/* 
  Localizable.strings
  TGPro

  Created by Matt Austin on 2016-01-13.
  Copyright © 2016 Tunabelly Software. All rights reserved.
*/

"FanAverageRPM" = "Average RPM";
"RegisterLicense" = "Activate License...";
"BuyNow" = "Buy License...";
"TrialDaysLeft" = "Trial: %d days left";
"TrialOneDayLeft" = "Trial: 1 day left";
"TrialZeroDaysLeft" = "Trial ends today";
"TrialOver" = "Trial expired";
"NotLicensedAndNoTrial" = "Unlicensed";

"FansDiagnosticWorkingProperlyMultiple" = "Fans appear to be working properly.";
"FansDiagnosticWorkingProperlyOne" = "The fan appears to be working properly.";
"FansDiagnosticWorkingProperlyNone" = "Unavailable - No fans were detected.";
"FansDiagnosticBadPrefix" = "These fans may not be working properly: ";
"FansDiagnosticUnknown" = "Unable to verify fans.";
"FansDiagnosticZeroRPM" = "These fans are at 0 RPM (not spinning), and may be broken or unplugged: %@";

"TemperaturesDiagnosticWorkingProperly" = "Temperature sensors appear to be working properly.";
"TemperaturesDiagnosticBadPrefix" = "These sensors may not be working properly: ";
"TemperaturesDiagnosticUnknown" = "Unable to verify temperature sensors.";

"DiagnosticTrial" = "Available after activating a license.";
"NoInternalBattery" = "This Mac does not have an internal battery.";

"InvalidTemperature" = "N/A";

"FanIsOffStatusMenuItemTitle" = "Fan turned off by hardware";
"FanAreOffStatusMenuItemTitle" = "Fans turned off by hardware";

"FanIsOffAlertTitle" = "Fan Disabled by Hardware";
"FanIsOffAlertBody" = "Due to low temperatures, this Mac model has automatically disabled the fan. If fan control is configured, TG Pro will resume control upon reactivation.";

"FansAreOffAlertTitle" = "Fans Disabled by Hardware";
"FansAreOffAlertBody" = "Due to low temperatures, this Mac model has automatically disabled the fans. If fan control is configured, TG Pro will resume control upon reactivation.";

"OK" = "OK";
"Yes" = "Yes";
"No" = "No";

"DefaultLogFileName" = "TG Pro Log.csv";
"DefaultLogFileNameWithoutSuffix" = "TG Pro Log";

"TemperatureOverThresholdNotification" = "To reduce the Mac's temperature, consider quitting high CPU usage applications or adjusting the fan settings.";
"TemperatureOverThresholdNoFanNotification" = "To lower the Mac's temperature, consider quitting applications that are consuming significant CPU resources.";

"FanControlInstallMessageAlreadyExists" = "TG Pro needs to install an updated version of the helper app used for fan control.\n\nYou will be asked to enter your Mac administrator password twice.\n\nFor privacy & security, it uses the hardened runtime and is notarized by Apple.";
"FanControlInstallMessageNew" = "TG Pro requires a helper app to be installed for fan control.\n\nYou will be asked to enter your Mac administrator password once.\n\nFor privacy & security, it uses the hardened runtime and is notarized by Apple.";

"DeregisterLicenseTitle" = "Deactivate License";
"DeregisterLicenseBody" = "Are you sure you would like to deactivate this license?\n\nThis will allow the license code to be used on another Mac.";

"DeregisterLicenseSuccessTitle" = "Deactivated License";
"DeregisterLicenseSuccessBody" = "Your license has been successfully deactivated.\n\nYou may now re-use it on any Mac you'd like.";

"DeregisterLicenseFailedTitle" = "Deactivating License Failed";
"DeregisterLicenseFailedBody" = "Your license has not been deactivated.\n\n%@";

"ActivatedLicenseBody" = "TG Pro is now fully licensed on this Mac.\n%1$ld of %2$ld activations are currently in use.";

"ActivationFailedTitle" = "Activation Issue";
"ActivationFailedBody" = "We're sorry, the activation was not successful. This may be due to an incorrect license code or a connection issue. Please check the following and try again:\n\n1. Verify that the license code is correct.\n\n2. Ensure the Internet connection is active and there are not any firewalls or network monitoring apps such as Little Snitch blocking the connection to the activation servers.";

"OneFanName" = "Main Fan";
"CPUThrottleFixMessage" = "-- Fans are being boosted to %.0f%% to avoid CPU throttling --";
"CPUThrottleFixMessageMenuItemTitle" = "Fans boosted to %.0f%% to avoid CPU throttling";

"StatusItemHiddenTitle" = "TG Pro Hidden";
"StatusItemHiddenBody" = "The menu bar item for TG Pro is currently hidden because there isn't enough space to display it. Try one or more of the following:\n\n• Change the Menu Bar preferences so it takes up less space.\n\n• Quit any unused menu bar apps.\n\n• Try a 3rd party solution such as Bartender to organize the menu bar items.";
"StatusItemHiddenWithNotchBody" = "The menu bar item for TG Pro is currently hidden because there either isn't enough space to display it, or it's obscured by the screen notch. Try one or more of the following:\n\n• Change the Menu Bar preferences so it takes up less space.\n\n• Quit any unused menu bar apps.\n\n• Try a 3rd party solution such as Bartender to organize the menu bar items.";
"ShowMenuBarPreferences" = "Open Menu Bar preferences";

"LicenseMigrationErrorTitle" = "License migration could not be completed";
"LicenseMigrationErrorBody"  = "TG Pro has switched to a new licensing system, built and managed by Tunabelly Software for a better experience. Migration from the previous system could not be completed after several attempts. Please ensure connections are allowed, including through any firewall or network tool such as Little Snitch. Migration will be retried on the next launch.\n\nDetails: %@";
